Community-PIO-CH32V/ArduinoCore-CH32H4/boards.txt
# Arduino IDE board definitions for the CH32H41x.
#
# GENERATED BY tools/makeboards.py -- edit that and re-run it, not this file.
#
# PlatformIO does not read this: it uses the board JSON in platform-ch32v and
# tools/platformio-build.py. The two are two statements of the same build, and
# the flash layout in both comes from the same numbers.

menu.serial=Serial port
menu.exceptions=C++ Exceptions
menu.fs=Filesystem size

# --------------------------------------------------------------------------
# CH32H417QEU6-R0-1v1
# --------------------------------------------------------------------------
ch32h417qeu6.name=CH32H417QEU6-R0-1v1
ch32h417qeu6.build.core=ch32h4
ch32h417qeu6.build.variant=CH32H417QEU6
ch32h417qeu6.build.mcu=ch32h417qeu6
ch32h417qeu6.build.f_cpu=400000000L
ch32h417qeu6.build.board=CH32H417QEU6
ch32h417qeu6.build.march=rv32imafc_zba_zbb_zbc_zbs_xw
ch32h417qeu6.build.mabi=ilp32f
ch32h417qeu6.build.flags.clock=-DSYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSE=400000000
ch32h417qeu6.upload.tool=wlink
ch32h417qeu6.upload.maximum_data_size=917504

# What `Serial` refers to. Serial1 is always USART1 on PA9/PA10, into the
# WCH-Link's VCP, whichever is chosen here.
#
# USB CDC is the default, as in the PlatformIO build, because it is what
# someone plugging the board into a PC expects to find. The sketch does not
# have to include Adafruit_TinyUSB.h: the library is pulled in by Arduino.h's
# own include of it, which fails during arduino-cli's library-detection pass
# because platform.txt deliberately holds the TinyUSB headers back from that
# pass -- see build.includes.detect there, which explains why an include path
# that resolves too early is the thing that breaks this.
#
# The USART1 option is worth keeping: a fault during static initialisation
# happens before USB has enumerated, so a board that only speaks CDC cannot
# report one.
ch32h417qeu6.menu.serial.usb=USB CDC
ch32h417qeu6.menu.serial.usb.build.flags.serial=-DCH32H4_USB -DUSE_TINYUSB -DCH32H4_SERIAL_IS_USB
ch32h417qeu6.menu.serial.uart=USART1
ch32h417qeu6.menu.serial.uart.build.flags.serial=

# Off by default, as in arduino-pico and the ESP cores. Enabling costs roughly
# 30 KB of unwind tables, which stay in flash and are read only when something
# throws.
#
# NOTE: --specs=nano.specs must never be added to make up the difference. It
# rewrites -lstdc++ to -lstdc++_nano, which has no .eh_frame, and every throw
# then reaches std::terminate -- after a perfectly clean link, with the failure
# visible only at run time.
ch32h417qeu6.menu.exceptions.Disabled=Disabled
ch32h417qeu6.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
ch32h417qeu6.menu.exceptions.Disabled.build.flags.exceptions.define=
ch32h417qeu6.menu.exceptions.Enabled=Enabled
ch32h417qeu6.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
ch32h417qeu6.menu.exceptions.Enabled.build.flags.exceptions.define=-DCH32H4_EXCEPTIONS

# The filesystem partition, immediately below the 16 KB EEPROM at the top of
# flash. LittleFS mounts it; tools/simplesub.py substitutes the size into the
# linker script, which then ASSERTs that the sketch region, the filesystem and
# the EEPROM tile the 983040-byte user area exactly.
#
# The EEPROM is NOT part of this menu. It is always present and always the last
# 16384 bytes, so that a sketch's stored settings survive a change of
# filesystem size -- which arduino-pico does the same way and for the same
# reason.
ch32h417qeu6.menu.fs.128k=128 KB
ch32h417qeu6.menu.fs.128k.build.fs_size=131072
ch32h417qeu6.menu.fs.128k.upload.maximum_size=802816
ch32h417qeu6.menu.fs.0k=None
ch32h417qeu6.menu.fs.0k.build.fs_size=0
ch32h417qeu6.menu.fs.0k.upload.maximum_size=933888
ch32h417qeu6.menu.fs.64k=64 KB
ch32h417qeu6.menu.fs.64k.build.fs_size=65536
ch32h417qeu6.menu.fs.64k.upload.maximum_size=868352
ch32h417qeu6.menu.fs.256k=256 KB
ch32h417qeu6.menu.fs.256k.build.fs_size=262144
ch32h417qeu6.menu.fs.256k.upload.maximum_size=671744
ch32h417qeu6.menu.fs.512k=512 KB
ch32h417qeu6.menu.fs.512k.build.fs_size=524288
ch32h417qeu6.menu.fs.512k.upload.maximum_size=409600

ch32h417qeu6.build.fs_size=131072
ch32h417qeu6.upload.maximum_size=802816
